## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: run
**Success**: :thumbsup:
**Details**: `terrateam_ssh_key_setup`
```
Writing TERRATEAM_SSH_KEY.* to ~/.ssh/
```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>


## Dir: envs/prod/s3 | :heavy_multiplication_x:
**Dir**: envs/prod/s3
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: init
**Success**: :thumbsup:
```

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 4.0"...
- Installing hashicorp/aws v4.67.0...
- Installed hashicorp/aws v4.67.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_s3_bucket.eu-central-1-buckets["covid19.acsl.se"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "covid19.acsl.se"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["covid19.acsl.se-logs"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "covid19.acsl.se-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["dq.acsl.se"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dq.acsl.se"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["dq.acsl.se-logs"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dq.acsl.se-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["masterpasswordgenerator.com"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "masterpasswordgenerator.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["masterpasswordgenerator.com-logs"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "masterpasswordgenerator.com-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["ndb.acsl.se"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ndb.acsl.se"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["yamldiff.com"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "yamldiff.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-central-1-buckets["yamldiff.com-logs"] will be created
  + resource "aws_s3_bucket" "eu-central-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "yamldiff.com-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-north-1-buckets["acsl-test-bucket"] will be created
  + resource "aws_s3_bucket" "eu-north-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "acsl-test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-north-1-buckets["countdown.acsl.se"] will be created
  + resource "aws_s3_bucket" "eu-north-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "countdown.acsl.se"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-north-1-buckets["stats-test.packagedepot.io"] will be created
  + resource "aws_s3_bucket" "eu-north-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "stats-test.packagedepot.io"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-north-1-buckets["stats-test.packagedepot.io-logs"] will be created
  + resource "aws_s3_bucket" "eu-north-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "stats-test.packagedepot.io-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-west-1-buckets["acompscilab.com"] will be created
  + resource "aws_s3_bucket" "eu-west-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "acompscilab.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eu-west-1-buckets["photodujour.net"] will be created
  + resource "aws_s3_bucket" "eu-west-1-buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "photodujour.net"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["covid19.acsl.se"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["covid19.acsl.se-logs"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["dq.acsl.se"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["dq.acsl.se-logs"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["masterpasswordgenerator.com"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["masterpasswordgenerator.com-logs"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["ndb.acsl.se"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["yamldiff.com"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-central-1-buckets["yamldiff.com-logs"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-central-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-north-1-buckets["acsl-test-bucket"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-north-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-north-1-buckets["countdown.acsl.se"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-north-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-north-1-buckets["stats-test.packagedepot.io"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-north-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-north-1-buckets["stats-test.packagedepot.io-logs"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-north-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-west-1-buckets["acompscilab.com"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-west-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.acl-eu-west-1-buckets["photodujour.net"] will be created
  + resource "aws_s3_bucket_acl" "acl-eu-west-1-buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)
    }

Plan: 30 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid provider configuration
│ 
│ Provider "registry.terraform.io/hashicorp/aws" requires explicit
│ configuration. Add a provider block to the root module and configure the
│ provider's required arguments as described in the provider documentation.
│ 
╵
╷
│ Error: configuring Terraform AWS Provider: validating provider credentials: retrieving caller identity from STS: operation error STS: GetCallerIdentity, failed to resolve service endpoint, an AWS region is required, but was not found
│ 
│   with provider["registry.terraform.io/hashicorp/aws"],
│   on <empty> line 0:
│   (source code not available)
│ 
╵

```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
